/*************************************************************************************************
 * <pre>
 * @项目名称:   CssTest
 * @版权所有:   csshotel (C) 2019
 *
 *
 * @类描述:
 * @版本:         V2.0.0
 * @作者:         wuxing
 * @邮箱:         xing.wu@Ctrip.com
 * @创建时间:     2019-04-30 12:10
 *
 * @修改记录：
 -----------------------------------------------------------------------------------------------
 ----------- 时间      |   修改人    |     修改的方法       |         修改描述   ---------------
 -----------------------------------------------------------------------------------------------
 </pre>
 ************************************************************************************************/
//正式环境
const PUBLICURL = "https://www.easy-mock.com/mock/5b813ce4e8258338ac71259f/wx"
//开发环境
const DEVURL = ""
//测试环境
const TESTURL = ""
//仿真环境
const SIMURL = ""

class _BaseUrl {
    //定义环境

    constructor() {
        //当前环境
        this.baseURL = ""
        this.setBaseUrl(PUBLICURL)
    }


    setBaseUrl(url) {
        this.baseURL = url
    }

    getBaseUrl() {
        return this.baseURL
    }

}

export let BaseUrl = new _BaseUrl()